audiopila-rails/app/controllers/audios_controller.rb

SELECT "audios".* FROM "audios"
---
  def index
    @audios = Audio.all

SELECT  "audios".* FROM "audios" WHERE "audios"."name" = ? LIMIT ?  [["name", "Allegro from Duet in C Major.mp3"], ["LIMIT", 1]]
INSERT INTO "audios" ("created_at", "updated_at", "name", "path") VALUES (?, ?, ?, ?)
---
  def sync_repo
    repo = Settings.repositories[params[:id].to_i]

    files = `find #{repo} -name "*.mp3" -o -name "*.m4a" -o -name "*.ogg"`
    files = files.split("\n")

    files.each do |file|
      file_name = file.split('/')[-1]

      unless Audio.find_by_name(file_name)
        Audio.create(name: file_name, path: file)

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def stream
    audio = Audio.find(params[:id])

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_audio
      @audio = Audio.find(params[:id])