videoshrimp-master/app/views/videos/index.haml

  .row
    - @videos.each do |video|
      .col-md-3.thumb.video-thumb{ 'data-video-id': video.id }
---
SELECT "videos".* FROM "videos"