videoshrimp-master/app/views/users/show.haml

SELECT "videos".* FROM "videos" WHERE "videos"."user_id" = ?  [["user_id", 1]]
---
  .row
    - @user.videos.each do |video|
      .col-md-3.thumb.video-thumb{ 'data-video-id': video.id }