Sample_apps/ishwar_sample/wiki-app/app/controllers/articles_controller.rb

SELECT `categories`.* FROM `categories`
SELECT `articles`.* FROM `articles`  ORDER BY created_at DESC
SELECT  `categories`.* FROM `categories` WHERE `categories`.`name` = 'Technology' LIMIT 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`category_id` = 2  ORDER BY created_at DESC
---
	def index
		if params[:category].blank?
			@articles =Article.all.order("created_at DESC")
		else
			@category_id = Category.find_by(name: params[:category]).id
			@articles= Article.where(category_id: @category_id).order("created_at DESC")

INSERT INTO `articles` (`title`, `content`, `category_id`, `user_id`, `created_at`, `updated_at`) VALUES ('phone', 'good', 2, 1, '2016-10-09 19:40:42', '2016-10-09 19:40:42')
---
	def create
		@article = current_user.articles.build(article_params)
		if @article.save

UPDATE `articles` SET `category_id` = 1, `updated_at` = '2016-10-10 07:57:28' WHERE `articles`.`id` = 3
---
	def update
		if @article.update(article_params)

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
---
		def find_article
			@article =Article.find(params[:id])