blog/app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
  @article = Article.find params[:id]

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Jeyavel"], ["text", "fmsdf nmdfdfb dsfdskhf"], ["created_at", 2017-02-10 10:55:21 UTC], ["updated_at", 2017-02-10 10:55:21 UTC]]
---
def create
  @article = Article.new article_params
  if @article.save