Sample_apps/Student_Detail/app/controllers/students_controller.rb

  def show
  	@student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1

  def create
  	puts params.inspect
    @student = Student.new(student_params)
    respond_to do |format|
      if @student.save
---
INSERT INTO `students` (`name`, `blood_group`, `department`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `created_at`, `updated_at`) VALUES ('mani', 'o+', 'computer', 'vertical_cylinder_cone_bottom_round_top.png', 'image/png', 1515, '2016-06-14 10:56:13', '2016-06-14 10:56:13', '2016-06-14 10:56:13')

   def edit
    @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 2 LIMIT 1

def destroy
    @student.destroy
---
DELETE FROM `students` WHERE `students`.`id` = 1

   def set_student
      @student = Student.find(params[:id])
---
SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1