Sample_apps/ishwar_sample/wiki-app/app/views/articles/_form.html.haml

SELECT `categories`.* FROM `categories`
---
=simple_form_for @article do |f|
	= f.collection_select :category_id,Category.all,:id,:name,{prompt:"Choose a category"}