videoshrimp-master/app/controllers/audios_controller.rb

SELECT "audios".* FROM "audios"
---
  def index
    @audios = Audio.all

INSERT INTO "audios" ("name", "path", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "sadasd"], ["path", "sadasd"], ["created_at", "2017-01-31 11:08:20.602068"], ["updated_at", "2017-01-31 11:08:20.602068"]]
---
  def create
    @audio = Audio.new(audio_params)

    respond_to do |format|
      if @audio.save

UPDATE "audios" SET "name" = ?, "updated_at" = ? WHERE "audios"."id" = ?  [["name", "Animals Sound"], ["updated_at", "2017-01-31 11:46:00.029136"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @audio.update(audio_params)

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT 1  [["id", 1]]
---
  def stream
    audio = Audio.find(params[:id])

SELECT  "audios".* FROM "audios" WHERE "audios"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_audio
      @audio = Audio.find(params[:id])