videoshrimp-master/app/controllers/mylists_controller.rb

SELECT "videos".* FROM "videos"
---
  def video_list

    puts Video.connection.inspect
    @videos = Video.all