videoshrimp-master/app/controllers/videos_controller.rb

INSERT INTO "videos" ("video_file_file_name", "video_file_content_type", "video_file_file_size", "video_file_updated_at", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save